[
  {
    "id": 1,
    "topic": "Java",
    "questions": [
      "Switch Statements (When to use? Syntax, logic)",
      "Scanner (Import, Scanner object, user input methods)",
      "String (What is the string? Index numbers, String creation, String methods)",
      "Custom methods: (What is a method? Why do we need methods? Syntax, Location)",
      "Custom methods: (Return type (return keyword), Parameters)",
      "Custom methods: (Method overloading)",
      "For loops (What is a loop? When we use ForLoop, Syntax, Logic)",
      "Branching statements (Keywords, Logic behind them)",
      "While loop, DoWhile loop (Logic, Syntax)",
      "Class, Objects (What's a class, Instance variables, Instance methods, Object)",
      "Memory allocation (Stack/Heap), Garbage collection (When is an object eligible for garbage collection?)",
      "Arrays (What is an array? Elements, Syntax, Array class, Array methods)",
      "Inheritance (What is inheritance, Types, Field hiding, Method overriding)",
      "Interface",
      "Polymorphism / instanceof",
      "Exceptions / Exception categories / Try&Catch blocks / Finally block / Exception object & methods",
      "What is the difference between String and StringBuilder in Java?",
            "How do you convert a List to a Set in Java?",
            "What are the access modifiers in Java, and how are they different?",
            "Explain the significance of the super keyword in Java.",
            "What is the use of the instanceof keyword in Java?",
            "What is the difference between == and equals() for object comparison?",
            "Explain how the HashSet works internally.",
            "What is the difference between TreeMap and HashMap?",
            "How does Java achieve platform independence?",
            "What is the purpose of the volatile keyword in Java?",
            "How do you implement a thread-safe Singleton pattern?",
            "What are the differences between ArrayList and Vector in Java?",
            "How do you handle circular references in Java collections?",
            "What are wrapper classes in Java? Provide examples.",
            "What is the difference between deep copy and shallow copy?",
            "How do you handle null pointer exceptions effectively in Java?",
            "What is a Callable in Java, and how is it different from a Runnable?",
            "Explain the concept of method hiding in Java.",
            "What is the difference between Iterator and ListIterator?",
            "How does ConcurrentHashMap ensure thread safety?",
            "What are the differences between wait() and sleep() in Java?",
            "How do you sort a List in Java?",
            "What is the difference between throw and throws in Java?",
            "Explain the use of Enum in Java with an example.",
            "What is the difference between Arrays and Collections in Java?",
            "How do you reverse a string in Java without using the reverse method?",
            "What is the purpose of the finalize() method in Java?",
            "How do you convert a JSON string to a Java object?",
            "What are the differences between static and non-static methods?",
            "What are the advantages of using annotations in Java?",
            "What is the difference between an abstract class and a concrete class?",
            "What is the difference between synchronized methods and synchronized blocks?",
            "How do you create an immutable class in Java?",
            "What are the differences between StringBuilder and StringBuffer?",
            "What is a Serializable interface in Java?",
            "How do you handle memory leaks in Java?",
            "What is the use of the Optional class in Java 8?",
            "How do you merge two streams in Java 8?",
            "Explain the try-with-resources statement in Java.",
            "What is the default size of HashMap in Java?",
            "How do you serialize and deserialize objects in Java?",
            "What is a thread pool, and how do you create one in Java?",
            "What is the Comparator interface in Java?",
            "What is the difference between map() and flatMap() in Java streams?",
            "How do you handle deadlocks in Java?",
            "How do you use custom exceptions in Java?",
            "What is the use of the reentrant lock in Java concurrency?",
            "How do you perform file handling in Java?",
            "What is Java, and why is it platform-independent?",
                  "What are the main features of Java?",
                  "What is the difference between JDK, JRE, and JVM?",
                  "How do you declare a variable in Java?",
                  "What are data types in Java? Provide examples.",
                  "What is the difference between int and double in Java?",
                  "What are the rules for naming variables in Java?",
                  "What is the purpose of the main() method in Java?",
                  "What is the difference between println() and print()?",
                  "How do you write comments in Java?",
                  "What are Java operators? Provide examples of arithmetic operators.",
                  "What is the purpose of the if-else statement in Java?",
                  "What are loops in Java? Provide examples of for and while loops.",
                  "What is the difference between break and continue statements?",
                  "What are arrays in Java? How do you declare them?",
                  "What is the purpose of methods in Java?",
                  "What is a return type in a method?",
                  "What is the difference between public, private, and protected access modifiers?",
                  "What are classes and objects in Java?",
                  "How do you create an object in Java?",
                  "What is a constructor in Java?",
                  "What is the difference between a default and a parameterized constructor?",
                  "What is inheritance in Java?",
                  "What is method overriding in Java?",
                  "What is the purpose of the super keyword in inheritance?",
                  "What is the difference between method overloading and method overriding?",
                  "What is the purpose of the static keyword in Java?",
                  "What is the purpose of the final keyword in Java?",
                  "What are the different types of loops in Java?",
                  "What is a string in Java?",
                  "How do you concatenate two strings in Java?",
                  "What are wrapper classes in Java?",
                  "What is the purpose of the parseInt() method in Java?",
                  "What is the difference between String and StringBuilder?",
                  "How do you handle exceptions in Java?",
                  "What is the difference between checked and unchecked exceptions?",
                  "What is the purpose of the try-catch block in Java?",
                  "What is the purpose of the finally block?",
                  "How do you create a simple Java program to print Hello, World?",
                  "What are packages in Java, and why are they used?",
                  "How do you import a package in Java?",
                  "What is the purpose of the Math class in Java?",
                  "What is the difference between == and equals()?",
                  "What is a boolean in Java?",
                  "How do you compare two numbers in Java?",
                  "What is the purpose of the switch statement in Java?",
                  "How do you convert a string to an integer in Java?",
                  "What is the purpose of the for-each loop in Java?",
                  "What are enums in Java?",
                  "How do you check the length of a string in Java?",
                  "How you reverse a string, verbally explain"
    ]
  },
  {
    "id": 2,
    "topic": "Selenium",
    "questions": [
      "What is Selenium? What version of Selenium do you use?",
      "What is the difference between Absolute and relative xPath?",
      "What is the difference between cssSelector vs xPath?",
      "When do you get staleElementReferenceException?",
      "Thread.sleep() vs implicitlyWait()?",
      "How do you handle checkboxes and radio buttons in Selenium?",
      "How do you handle dynamic web elements / StaleElementReferenceException?",
      "What is TestNG? What annotations of TestNG do you know?",
      "What is \"PAGE OBJECT MODEL\" design model? How to implement it?",
      "What is the difference between the @Before and @BeforeClass annotations in JUnit?",
            "How do you use data tables in Cucumber?",
            "What is a Cucumber tag, and how do you use it?",
            "How do you handle dropdowns using Selenium?",
            "What are the advantages of using Cucumber for test automation?",
            "What is the use of the @Test annotation in JUnit?",
            "How do you handle page navigation in Selenium?",
            "What is the difference between hard asserts and soft asserts in Selenium?",
            "How do you generate reports in Cucumber?",
            "What is the difference between feature files and step definitions in Cucumber?",
            "How do you handle SSL certificate errors in Selenium?",
            "How do you run tests in parallel using Cucumber and JUnit?",
            "How do you use the @DataProvider annotation in TestNG?",
            "How do you test REST APIs using Selenium?",
            "What is the difference between findElement() and findElements() in Selenium?",
            "How do you set up browser capabilities in Selenium?",
            "How do you validate a web page's title using Selenium?",
            "What are the best practices for writing feature files in Cucumber?",
            "How do you use hooks in Cucumber?",
            "How do you integrate Cucumber with JUnit?",
            "What are the limitations of Selenium WebDriver?",
            "How do you use the WebDriverWait class in Selenium?",
            "How do you simulate keyboard actions in Selenium?",
            "How do you use the Actions class in Selenium?",
            "What is the purpose of the Scenario interface in Cucumber?",
            "How do you implement page object models in Selenium?",
            "How do you use external data files with Cucumber?",
            "How do you handle file downloads in Selenium?",
            "What is the difference between absolute and relative XPath?",
            "What is the difference between @Before and @BeforeAll annotations in JUnit?",
                 "How do you execute JUnit tests in a specific order?",
                 "What are the different types of locators in Selenium?",
                 "How do you perform browser navigation using Selenium?",
                 "What is the purpose of the WebDriver interface in Selenium?",
                 "How do you manage test data in Cucumber?",
                 "What are the advantages of parameterized tests in JUnit?",
                 "What is the difference between @RunWith and @Suite annotations in JUnit?",
                 "How do you capture browser console logs using Selenium?",
                 "What is the difference between 'driver.quit()' and 'driver.close()'?",
                 "How do you handle JavaScript alerts in Selenium?",
                 "What are the advantages of using data tables in Cucumber?",
                 "How do you implement conditional hooks in Cucumber?",
                 "What is the purpose of the ScenarioOutline in Cucumber?",
                 "How do you manage dependency injection in Cucumber?",
                 "What is the difference between @Step and @Then annotations in Cucumber?",
                 "How do you implement retry logic in Selenium tests?",
                 "How do you integrate Selenium tests with Jenkins?",
                 "How do you verify an element is enabled or disabled in Selenium?",
                 "How do you handle exceptions in JUnit tests?",
                 "How do you execute only specific scenarios in Cucumber using tags?",
                 "What is the purpose of @Ignore in JUnit?",
                 "How do you simulate a mouse hover action using Selenium?",
                 "How do you switch between multiple tabs in Selenium?",
                 "What are the best practices for writing feature files in Cucumber?",
                 "How do you run Cucumber tests in parallel?",
                 "How do you configure browser capabilities in Selenium?",
                 "How do you use the @DataProvider annotation in conjunction with Selenium?",
                 "How do you validate broken links on a webpage using Selenium?",
                 "What is the purpose of the Actions class in Selenium?",
                 "How do you upload files using Selenium?",
                 "What is the use of SoftAssert in Selenium?",
                 "How do you use the PageFactory class in Selenium?",
                 "What is the difference between FluentWait and WebDriverWait in Selenium?",
                 "How do you handle dropdown menus using Selenium?",
                 "What are some limitations of Selenium WebDriver?",
                 "How do you generate HTML reports for Cucumber tests?",
                 "What is the purpose of the Background keyword in Cucumber?",
                 "How do you handle dynamic web elements in Selenium?",
                       "What is the difference between absolute and relative XPath?",
                       "How do you validate element visibility in Selenium?",
                       "How do you handle dropdown menus using Select class?",
                       "How do you perform drag-and-drop actions in Selenium?",
                       "What is the purpose of JavaScriptExecutor in Selenium?",
                       "How do you handle AJAX calls in Selenium?",
                       "What is the difference between implicit and explicit waits?",
                       "How do you validate cookies using Selenium?",
                       "What are the challenges of cross-browser testing with Selenium?",
                       "How do you handle file uploads in Selenium?",
                       "How do you handle pop-ups and alerts in Selenium?",
                       "What is FluentWait, and how is it used?",
                       "How do you verify broken links on a webpage using Selenium?",
                       "How do you handle multiple windows and tabs in Selenium?",
                       "What is the purpose of the Actions class in Selenium?",
                       "How do you capture screenshots in Selenium tests?",
                       "How do you manage browser sessions in Selenium?",
                       "What is the Page Object Model (POM), and why is it used?",
                       "How do you implement a Page Factory in Selenium?",
                       "What are the best practices for writing Selenium test scripts?",
                       "What is the difference between CSS selectors and XPath?",
                       "How do you perform parallel execution of tests in Selenium?",
                       "How do you handle StaleElementReferenceException in Selenium?",
                       "What is the use of DesiredCapabilities in Selenium?",
                       "How do you set up Selenium Grid for distributed testing?",
                       "How do you handle timeouts in Selenium?",
                       "What is the purpose of the getWindowHandle() method?",
                       "How do you perform mouse hover actions in Selenium?",
                       "What is the purpose of the maximize() method in Selenium?",
                       "How do you validate a webpage's title using Selenium?",
                       "How do you manage dependencies in Selenium projects?",
                       "How do you scroll to an element on a webpage using Selenium?",
                       "What are the limitations of Selenium WebDriver?",
                       "How do you handle SSL certificate errors in Selenium?",
                       "How do you handle shadow DOM elements in Selenium?",
                       "What is the difference between get() and navigate() in Selenium?",
                       "How do you integrate Selenium with TestNG?",
                       "How do you execute Selenium tests in a CI/CD pipeline?"
    ]
  },
  {
    "id": 3,
    "topic": "SQL",
    "questions": [
        "What is the difference between WHERE and HAVING clauses?",
              "Explain the concept of normalization and its types.",
              "What are indexes in SQL? How do they improve performance?",
              "How do you use the GROUP BY clause in SQL?",
              "Explain the difference between INNER JOIN and OUTER JOIN.",
              "What is a subquery in SQL? Provide examples.",
              "How do you calculate the difference between two dates in SQL?",
              "What are constraints in SQL? Provide examples.",
              "How do you write a recursive query in SQL?",
              "What are the differences between DELETE and TRUNCATE?",
              "What is JDBC",
              "What is SQL, and why is it used?",
                    "What are the different types of SQL commands?",
                    "What is the purpose of the SELECT statement in SQL?",
                    "How do you retrieve all records from a table?",
                    "What is a primary key in SQL?",
                    "What is a foreign key, and why is it used?",
                    "What is the difference between WHERE and HAVING clauses?",
                    "How do you sort data using the ORDER BY clause in SQL?",
                    "What is the purpose of the GROUP BY clause?",
                    "What are aggregate functions in SQL? Provide examples.",
                    "What is the difference between COUNT() and SUM() functions?",
                    "How do you filter records in SQL?",
                    "What is the purpose of the DISTINCT keyword?",
                    "What are joins in SQL? Name the different types of joins.",
                    "What is the difference between INNER JOIN and LEFT JOIN?",
                    "How do you insert data into a table in SQL?",
                    "What is the purpose of the UPDATE statement in SQL?",
                    "How do you delete records from a table in SQL?",
                    "What is the purpose of the LIMIT keyword?",
                    "What is the difference between CHAR and VARCHAR?",
                    "How do you retrieve the current date and time in SQL?",
                    "What is the difference between NULL and NOT NULL constraints?",
                    "What is the purpose of the ALTER TABLE statement?",
                    "How do you rename a column in SQL?",
                    "What are wildcards in SQL, and how are they used?",
                    "What is the purpose of the LIKE operator in SQL?",
                    "What is the difference between a database and a table?",
                    "What is a default constraint in SQL?",
                    "How do you create a new table in SQL?",
                    "What is a view in SQL, and why is it used?",
                    "What is the purpose of the DROP TABLE statement?",
                    "What are indexes in SQL, and how do they improve performance?",
                    "What is a composite key in SQL?",
                    "What is the difference between DELETE and TRUNCATE commands?",
                    "How do you calculate the average of a column in SQL?",
                    "What is the purpose of the UNION operator?",
                    "How do you handle duplicate records in SQL?",
                    "What is the purpose of the CASE statement in SQL?",
                    "How do you retrieve the first N rows from a table?"
    ]
  },
  {
    "id": 4,
    "topic": "Git",
    "questions": [
        "What is the purpose of branching in Git?",
              "How do you resolve a merge conflict?",
              "What is the difference between 'git fetch' and 'git pull'?",
              "How do you revert a commit in Git?",
              "What is Git rebase and when should it be used?",
              "How do you stash changes in Git?",
              "What is the purpose of a Git tag?",
              "What are the different types of Git tags?",
              "What is the difference between 'git reset' and 'git revert'?",
              "Explain the Git workflow for collaborative development.",
              "How do you remove files from a Git repository?",
              "What is the purpose of the .gitignore file?",
              "How do you compare commits in Git?",
              "How do you track changes in a specific file in Git?",
              "How do you undo changes in Git before committing?",
              "What is Git, and why is it used?",
                    "What is the difference between Git and GitHub?",
                    "How do you initialize a new Git repository?",
                    "What is a commit in Git?",
                    "What is the purpose of the git add command?",
                    "How do you check the status of your repository in Git?",
                    "What is the purpose of the .gitignore file?",
                    "How do you create a new branch in Git?",
                    "What is a merge in Git?",
                    "How do you switch between branches in Git?",
                    "What is the purpose of the git clone command?",
                    "What is a pull request in Git?",
                    "What is the difference between git fetch and git pull?",
                    "How do you resolve merge conflicts in Git?",
                    "What is the HEAD in Git?",
                    "How do you undo the last commit in Git?",
                    "What is the difference between git reset and git revert?",
                    "How do you delete a branch in Git?",
                    "What is the purpose of the git stash command?",
                    "How do you view the commit history in Git?",
                    "What is a remote repository in Git?",
                    "How do you add a remote repository in Git?",
                    "What is the purpose of the git push command?",
                    "What is a tag in Git, and how do you create one?",
                    "How do you check differences between two commits in Git?",
                    "What is the purpose of the git log command?",
                    "How do you rename a branch in Git?",
                    "How do you configure your username and email in Git?",
                    "What is the purpose of the git diff command?",
                    "What is a fork in Git?",
                    "How do you update a forked repository in Git?",
                    "What is a Git workflow, and why is it important?",
                    "What is the difference between fast-forward and non-fast-forward merges?",
                    "How do you revert changes to a file in Git?",
                    "What is the difference between git status and git log?",
                    "How do you list all branches in a repository?",
                    "How do you check out a previous commit in Git?",
                    "How do you view the changes made to a file in Git?",
                    "What is the difference between local and remote branches in Git?",
                    "Hoq do you handle conflicts ?"
    ]
  },
  {
    "id": 5,
    "topic": "API Testing",
    "questions": [
        "What is the difference between REST and SOAP APIs?",
              "How do you validate response headers in API testing?",
              "What are the different types of HTTP request methods?",
              "How do you authenticate REST APIs?",
              "What is the purpose of JSON schema validation?",
              "What are the common status codes used in API testing?",
              "How do you test API performance?",
              "How do you use Postman for API testing?",
              "How do you handle dynamic API parameters?",
              "What is the difference between query parameters and path parameters?",
              "What is OAuth, and how is it used in API testing?",
              "How do you test APIs with large payloads?",
              "What are the advantages of using RestAssured for API testing?",
              "How do you write assertions in API testing?",
              "What is the use of the GET method in APIs?",
              "How do you handle pagination in API responses?",
              "How do you test APIs with authentication tokens?",
              "How do you validate XML responses in API testing?",
              "What is the difference between SOAP and REST protocols?",
              "How do you test the scalability of APIs?",
              "What are the key features of RestAssured?",
                    "How do you set up RestAssured in a Maven project?",
                    "What is the difference between GET and POST requests in RestAssured?",
                    "How do you send a PUT request using RestAssured?",
                    "How do you validate response status codes using RestAssured?",
                    "What is the purpose of the given(), when(), and then() methods in RestAssured?",
                    "How do you handle query parameters in RestAssured?",
                    "How do you add headers to an API request in RestAssured?",
                    "How do you extract a specific field from a JSON response using RestAssured?",
                    "What are the different ways to validate API response body using RestAssured?",
                    "How do you set up authentication for APIs in RestAssured?",
                    "What are the advantages of using RestAssured for API testing?",
                    "How do you handle path parameters in RestAssured?",
                    "How do you write assertions for response time in RestAssured?",
                    "What is the use of `Response` and `RequestSpecification` in RestAssured?",
                    "How do you configure base URI and base path in RestAssured?",
                    "How do you test APIs with complex JSON structures using RestAssured?",
                    "What are RestAssured filters, and how do you use them?",
                    "How do you handle multipart/form-data requests in RestAssured?",
                    "How do you log request and response details in RestAssured?",
                    "What is Serialization in Java, and why is it needed?",
                    "How do you serialize a Java object into JSON using Jackson or Gson?",
                    "What is Deserialization, and how is it implemented in RestAssured?",
                    "How do you handle nested JSON deserialization in Java?",
                    "What is the purpose of POJO classes in API testing?",
                    "How do you create a POJO class for JSON deserialization?",
                    "How do you handle a list of objects in JSON using POJO classes?",
                    "What are the key annotations used in Jackson for Serialization/Deserialization?",
                    "How do you ignore specific fields during Serialization/Deserialization?",
                    "What is the difference between @JsonProperty and @JsonAlias annotations?",
                    "How do you handle date/time fields in Serialization/Deserialization?",
                    "How do you validate schema using RestAssured?",
                    "What is the use of ObjectMapper in Jackson library?",
                    "How do you handle polymorphic types during Serialization in Java?",
                    "What are the common exceptions during Serialization/Deserialization, and how do you resolve them?",
                    "How do you serialize an object with circular references?",
                    "How do you serialize an object to an XML format?",
                    "How do you test APIs that require nested POJOs for requests?",
                    "What is the difference between Serialization using Gson and Jackson libraries?",
                    "How do you dynamically map JSON keys to POJO fields?",
                    "What is the difference between PUT and PATCH methods?",
                          "How do you validate the structure of a JSON response?",
                          "What is the difference between SOAP and REST APIs?",
                          "How do you test APIs with authentication headers?",
                          "What is the purpose of status codes 204 and 304?",
                          "How do you handle API rate limits in testing?",
                          "What is the use of the Content-Type header in HTTP requests?",
                          "How do you validate error responses from APIs?",
                          "What is the difference between a synchronous and asynchronous API?",
                          "How do you write negative test cases for APIs?",
                          "What is the role of the Accept header in an HTTP request?",
                          "How do you test APIs with dynamic query parameters?",
                          "What are the common HTTP request methods, and when are they used?",
                          "How do you perform performance testing of APIs?",
                          "What is OAuth 2.0, and how is it implemented in API testing?",
                          "What tools can be used for API mocking?",
                          "How do you test APIs that use JWT (JSON Web Tokens) for authentication?",
                          "What is the purpose of the OPTIONS method in HTTP?",
                          "How do you test API response time and throughput?",
                          "What is the difference between API testing and UI testing?",
                          "How do you handle API redirects in testing?",
                          "What is GraphQL, and how does it differ from REST APIs?",
                          "How do you validate nested JSON responses?",
                          "What is the use of the Authorization header in API testing?",
                          "How do you test APIs that support multiple environments (e.g., dev, test, prod)?",
                          "How do you verify API response headers?",
                          "What is a mock server, and how is it used in API testing?",
                          "How do you handle API payloads with large data sets?",
                          "What are the key challenges in API testing?",
                          "How do you test APIs that depend on third-party services?",
                          "What is the purpose of API versioning, and how is it tested?",
                          "How do you simulate slow network conditions while testing APIs?",
                          "What is an API gateway, and how does it impact testing?",
                          "How do you test APIs for concurrency and data consistency?",
                          "What are the advantages of using Swagger for API testing?",
                          "How do you perform data-driven API testing?",
                          "How do you test APIs that return paginated responses?",
                          "What is the difference between functional and non-functional API testing?",
                          "How do you test APIs with custom headers?",
                          "What does it mean if your status code is in 500s?"
    ]
  },
  {
    "id": 6,
    "topic": "CI/CD",
    "questions": [
              "What is CI/CD and why is it important?",
              "What is the purpose of a build pipeline?",
              "How do you implement a CI pipeline using Jenkins?",
              "What is the difference between CI and CD?",
              "What is the role of Docker in CI/CD pipelines?",
              "How do you automate testing in a CI/CD pipeline?",
              "What are the advantages of using cloud-based CI/CD tools?",
              "What are the key challenges of implementing CI/CD?",
              "What are the differences between Jenkins and GitLab CI?",
              "What is the importance of branching strategies in CI/CD?"
    ]
  }
]
